-- MySQL dump 10.13  Distrib 8.0.32, for Win64 (x86_64)
--
-- Host: localhost    Database: sfmisystem
-- ------------------------------------------------------
-- Server version	8.0.32-0ubuntu0.22.04.2

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `pln_receive`
--

DROP TABLE IF EXISTS `pln_receive`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `pln_receive` (
  `pr_id` int NOT NULL AUTO_INCREMENT,
  `pr_no` varchar(45) DEFAULT NULL,
  `sc_id` int DEFAULT NULL,
  `receive_form` varchar(255) DEFAULT NULL,
  `sy_id` int DEFAULT NULL,
  `budget_year` varchar(45) DEFAULT NULL,
  `user_receive` int DEFAULT NULL,
  `receive_money_type` int DEFAULT '3' COMMENT 'ประเภทการรับเงิน\\\\\\\\\\\\\\\\n1 เช็ค\\\\\\\\\\\\\\\\n2 เงินสด 3เงินฝากธนนาคาร ',
  `receive_date` date DEFAULT NULL,
  `cf_transaction` int DEFAULT '0' COMMENT '0 = กำลังแก้ไข | 1 = สร้าง Transaction รับเงินและปิดการแก้ไข',
  `up_by` int DEFAULT NULL,
  `del` int DEFAULT '0',
  `create_date` datetime DEFAULT NULL,
  `update_date` datetime DEFAULT NULL,
  PRIMARY KEY (`pr_id`)
) ENGINE=InnoDB AUTO_INCREMENT=33 DEFAULT CHARSET=utf8mb4;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `pln_receive`
--

LOCK TABLES `pln_receive` WRITE;
/*!40000 ALTER TABLE `pln_receive` DISABLE KEYS */;
INSERT INTO `pln_receive` VALUES (1,'1',1,'Mr.sante Mana',14,'2565',31,1,'2022-07-21',0,90,1,'2022-07-22 07:34:51','2022-07-22 11:09:00'),(2,'2',1,'กองอำนวยการทหารบกที่ 23',14,'2565',84,1,'2022-07-26',0,90,1,'2022-07-25 04:08:16','2022-07-25 04:08:16'),(3,'3',1,'ยอดยกมาจากปี 2564',14,'2565',85,3,'0449-12-31',0,90,1,'2022-07-26 09:19:51','2022-07-26 09:19:51'),(4,'4',1,'สมพงษ์',14,'2565',82,3,'2022-07-25',0,31,1,'2022-07-26 10:02:53','2022-08-02 04:23:50'),(5,'5',1,'คุณปรีดา สามารถ',14,'2565',85,3,'2022-07-28',0,31,1,'2022-07-29 08:44:33','2022-07-29 08:45:16'),(6,'6',1,'สมพงษ์',14,'2565',90,1,'2022-08-01',0,31,1,'2022-08-02 10:20:11','2022-08-02 10:20:11'),(9,'7',1,'สมพงษ์',14,'2565',90,1,'2022-08-02',0,31,1,'2022-08-03 02:44:24','2022-08-03 02:44:24'),(10,'8',1,'สมศัก',14,'2565',90,1,'2022-08-02',0,31,1,'2022-08-03 03:03:24','2022-08-03 03:03:24'),(11,'9',1,'Mr.Banan Ban',14,'2565',82,1,'2022-08-03',0,31,0,'2022-08-04 04:44:08','2022-08-04 04:44:08'),(12,'10',1,'Demo A School and GG',14,'2565',85,2,'2022-08-03',0,31,0,'2022-08-04 07:57:13','2022-08-04 08:03:58'),(13,'11',1,'Banna BB',14,'2565',92,1,'2022-08-03',0,31,0,'2022-08-04 09:16:17','2022-08-04 09:16:17'),(14,'12',1,'ManTa Style',14,'2565',83,2,'2022-08-03',0,31,0,'2022-08-04 09:17:15','2022-08-04 09:17:15'),(15,'13',1,'สม',14,'2565',90,1,'2022-08-04',0,31,0,'2022-08-05 05:32:57','2022-08-05 05:32:57'),(16,'14',1,'สมศัก',14,'2565',90,2,'2022-08-04',0,31,0,'2022-08-05 05:33:49','2022-08-05 05:33:49'),(17,'15',1,'โรงเรียนประชาสัน',14,'2565',84,2,'2022-08-06',0,90,0,'2022-08-07 03:00:49','2022-08-07 03:01:22'),(18,'16',1,'Mr.sit Sanm',14,'2565',83,3,'2022-08-07',0,31,0,'2022-08-08 05:15:47','2022-08-09 03:57:42'),(19,'1',2,'สพฐ',21,'25655',97,3,'2022-10-05',0,97,0,'2022-10-06 17:21:42','2022-10-06 17:21:42'),(20,'1',11,'สมหมาย',21,'2565',108,3,'2022-10-09',0,108,0,'2022-10-10 16:11:15','2022-10-10 16:11:15'),(21,'2',11,'โรงสีข้าวนคร',21,'2565',104,3,'2022-10-09',0,109,0,'2022-10-10 16:16:55','2022-10-10 16:16:55'),(22,'3',11,'สมพงษ์',21,'2565',108,1,'2022-10-09',0,108,0,'2022-10-10 16:19:50','2022-10-10 16:19:50'),(23,'3ก5652232/01',2,'สำนักงานคณะกรรมการการศึกษาขั้นพื้นฐาน',21,'2565',97,3,'2022-10-20',0,97,0,'2022-10-22 06:23:01','2022-10-22 06:23:01'),(24,'4',11,'สมพงษ์',21,'2565',108,2,'2022-10-25',0,108,0,'2022-10-26 17:06:16','2022-10-26 17:06:16'),(25,'21ก123465',2,'สพฐ',21,'2565',110,3,'2022-10-27',0,110,0,'2022-10-28 15:27:39','2022-10-28 15:27:39'),(26,'1',2,'อบต.ทดลองทำงบ',21,'2565',98,1,'2022-11-15',0,98,0,'2022-11-16 09:45:56','2022-11-16 09:45:56'),(27,'1',12,'สมชาย',1,'2565',121,3,'2023-03-09',0,121,0,'2023-03-10 16:34:03','2023-03-10 16:34:03'),(28,'1',12,'demo',1,'2565',120,3,'2023-03-12',0,120,0,'2023-03-13 12:21:28','2023-03-13 12:21:28'),(29,'บร. 1 ก.345/2566',20,'สพฐ.',1,'2566',131,3,'2023-03-13',0,133,0,'2023-03-14 17:02:53','2023-03-14 17:04:20'),(30,'1',20,'อาจารย์เพ็ญครี ',1,'2566',134,3,'2023-03-16',0,134,0,'2023-03-17 15:29:50','2023-03-17 15:29:50'),(31,'2',20,'สมหมาย',1,'2566',133,3,'2023-03-16',0,134,0,'2023-03-17 16:22:03','2023-03-17 16:22:03'),(32,'3',20,'สมปอง',1,'2566',134,3,'2023-03-19',0,134,0,'2023-03-20 11:57:59','2023-03-20 11:57:59');
/*!40000 ALTER TABLE `pln_receive` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2023-04-03  7:16:58
