-- MySQL dump 10.13  Distrib 8.0.32, for Win64 (x86_64)
--
-- Host: localhost    Database: sfmisystem
-- ------------------------------------------------------
-- Server version	8.0.32-0ubuntu0.22.04.2

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `tb_partner`
--

DROP TABLE IF EXISTS `tb_partner`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `tb_partner` (
  `p_id` int NOT NULL AUTO_INCREMENT,
  `p_type` int NOT NULL DEFAULT '1' COMMENT '1 = บุคคลธรรมดา | 2 = นิติบุคคล',
  `p_no` varchar(45) DEFAULT NULL,
  `p_name` varchar(250) NOT NULL,
  `pay_type` int DEFAULT '1' COMMENT '1 บค. = บุคคลภายใน ||\n 2 บจ. = บุคคลภายนอก',
  `payee` varchar(250) DEFAULT NULL COMMENT 'ชื่อผู้มีอำนาจรับเงิน',
  `p_address` text,
  `p_phone` varchar(100) DEFAULT NULL,
  `p_fax` varchar(100) DEFAULT NULL,
  `p_id_tax` varchar(45) DEFAULT NULL,
  `cal_vat` int DEFAULT '2' COMMENT '2 บุคคลภายใน ||\\\\n1 คำนวน ||\\\\n0 ไม่คำนวน',
  `sc_id` int DEFAULT NULL,
  `del` int DEFAULT '0' COMMENT '0 = actice | 1 = delete',
  `cre_by` int DEFAULT NULL,
  `create_date` datetime DEFAULT NULL,
  `update_date` datetime DEFAULT NULL,
  PRIMARY KEY (`p_id`)
) ENGINE=InnoDB AUTO_INCREMENT=31 DEFAULT CHARSET=utf8mb4;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `tb_partner`
--

LOCK TABLES `tb_partner` WRITE;
/*!40000 ALTER TABLE `tb_partner` DISABLE KEYS */;
INSERT INTO `tb_partner` VALUES (1,1,'A5-3322-5421','คุณดวงพร จัทรศรี',2,NULL,'ab','ab','ab','1145-00254-3365',0,2,0,90,'2022-04-27 05:49:07','2022-07-26 09:23:39'),(2,2,'กช4225','ดีจริงการค้า',2,NULL,'KK-2000','0435164879','043-516-487','1002365478',1,1,0,90,'2022-04-27 09:35:08','2022-07-26 09:24:37'),(3,1,'ac-3305','ร้าน ป.เครื่องเขียน',2,' คุณปู','ac','064-632-5887','ac','ac',0,1,0,90,'2022-04-28 04:29:22','2022-07-26 09:24:16'),(4,1,'รค-123','สมหมาย ขายของ',2,'คุณสมหมาย','399/11','0888888888','1212312121','22312326263',0,1,0,31,'2022-07-05 05:10:24','2022-08-09 05:50:32'),(7,1,'-','-',1,'สมพงษ์ สองสาม','กผฟ/234','0812345678','-','-',0,1,0,31,'2022-08-25 08:18:38','2022-08-25 08:27:07'),(10,1,'-','-',1,'นานา','ๆไกๆกไๆๆไก','123456789','-','-',2,1,0,31,'2022-08-25 08:28:23','2022-08-25 08:28:23'),(11,1,'-','-',1,'อ.เพ็ญศรี','โรงเรียน','0899554321','-','3571200054671',2,1,0,90,'2022-09-17 10:04:34','2022-09-17 10:04:34'),(12,1,'8571584128811','ร้านพีพีเครื่องเขียน',2,'นางสาววิภาพร  แซ่ว่าง','19 หมู่ที่ 3  ตำบลแม่จัน อำเภอแม่จัน จังหวัดเชียงราย รหัสไปรษณ๊ 57110','0654939321','-','8571584128811',2,2,0,110,'2022-10-06 14:04:18','2023-03-14 15:43:49'),(13,1,'P-001','ดีจริงเครื่องเขียน',2,'คุณนรกมล นิจจารีย์','256/344 Moo.4, Ramkhumhaeng Road, Tambon Klongkum, Amphur Bungkum, Bangkok, 12400','043-636-5544','-','-',0,11,0,106,'2022-10-10 14:55:42','2022-10-10 14:56:03'),(14,2,'A-001','สมานการยาง',2,'คุณปรีณาพรรณ ปูริดา','256/344 Village No.4 Ramkhumhaeng Road, Klongkum Sub-district, Bungkum District, Bangkok, 12400','086-541-2542','-','3459922541254',1,11,0,106,'2022-10-10 14:57:48','2022-10-10 15:01:46'),(15,1,'C-33','คุณครูพลวรรธน์ มนพัทธ์',1,'คุณครูพลวรรธน์ มนพัทธ์','256/344 หมู่ 4 ถนนรามคำแหง ตำบลคลองกุ่ม อำเภอบึงกุ่ม กรุงเทพมหานคร 12400','095-663-5857','-','-',0,11,0,109,'2022-10-10 14:59:38','2022-11-02 11:44:04'),(16,1,'-','-',1,'กรณ์','933/2','0812345678','-','-',2,2,1,110,'2022-11-02 11:37:09','2022-11-02 11:37:09'),(17,2,'สรรพากร','สรรพากร',2,'สรรพากร อำเภอแม่จัน','ฟหกฟหก','08124454545','-08124454545','-08124454545',0,2,0,97,'2022-11-08 14:34:19','2022-11-08 14:40:06'),(18,2,'สำนักงานเขตพื้นที่การศึกษา ฯ','สำนักงานเขตพื้นที่การศึกษา ฯ',2,'สำนักงานเขตพื้นที่การศึกษา ฯ','กฟหกฟห','ฟหกฟหก','ฟหก','ฟหก',0,2,0,97,'2022-11-08 14:34:56','2022-11-08 14:39:45'),(19,2,'ทดสอบ','ทดสอบ',2,'ทดสอบ','ดหกดหกดหก','08122554566','-','-',0,2,0,97,'2022-11-08 14:40:57','2022-11-08 14:41:21'),(20,2,'MASTER01','สรรพากร',2,'สรรพากร','สรรพากร 55/2','088-885-8888','043-555-5555','88-88888-88888-8',0,11,0,108,'2022-11-09 09:41:42','2022-11-09 09:42:32'),(21,2,'MASTOER02','สำนักงานเขตพื้นที่การศึกษา',2,'สำนักงานเขตพื้นที่การศึกษา','สำนักงานเขตพื้นที่การศึกษา 1/1','043-999-9999','043-999-9999','99-9999-9-9999-99',0,11,0,108,'2022-11-09 09:44:26','2022-11-09 09:44:36'),(22,1,'M-150','สมหมายขายของ',1,'สมหมาย','123/124','0812345678','-','-',2,11,0,108,'2022-11-09 10:10:00','2022-11-09 10:10:00'),(23,1,'M-79','สมพงษ์ ขายทุกอย่าง',1,'สมพงษ์','58/32','0812345678','-','-',2,11,1,108,'2022-11-09 10:16:37','2022-11-09 10:16:37'),(24,1,'M-142','พรศักดิ์เครื่องเขียน',2,'พรศักดิ์','181/2392','0812345678','-','-',2,11,1,108,'2022-11-09 10:21:52','2022-11-09 10:21:52'),(25,2,'demo-01','demo',2,'test demo','dedede','0812345678','-','-',1,11,0,108,'2022-11-09 10:27:04','2022-11-09 10:27:44'),(26,1,'M-270','บานาน่า',1,'คุณบา','bb/489','08123456478','-','-',0,11,0,108,'2022-11-09 10:29:38','2022-11-09 10:29:38'),(27,1,'โครงการอาหารกลางวัน','โรงเรียนบ้านพญาไพร',1,'นางสาววรสรินทร์ พิร่ำ','394 หมู่ 2','089955091','-','1571200034268',0,2,0,98,'2022-11-16 09:43:05','2022-11-16 09:43:53'),(28,2,'sl-1','ร้านสมหมาย ขายของ',2,'นายสมหมาย','11/50 banana land','0812345678','-','-',0,12,0,121,'2023-03-10 16:17:01','2023-03-10 16:17:01'),(29,2,'35446','มีเครื่องเขียน',2,'นายมี ดีจริง','Deltasoft ประเทษไทย 40000 ','043-569-9987','-','0221547854412',1,20,0,133,'2023-03-14 15:41:16','2023-03-14 15:41:16'),(30,1,'-','-',1,'ครูมานะ มีนะ','โรงเรียนขามแก่น','083-669-5857','-','-',0,20,0,133,'2023-03-14 15:42:02','2023-03-14 15:42:02');
/*!40000 ALTER TABLE `tb_partner` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2023-04-03  7:18:52
