-- MySQL dump 10.13  Distrib 8.0.32, for Win64 (x86_64)
--
-- Host: localhost    Database: sfmisystem
-- ------------------------------------------------------
-- Server version	8.0.32-0ubuntu0.22.04.2

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `pln_receive_detail`
--

DROP TABLE IF EXISTS `pln_receive_detail`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `pln_receive_detail` (
  `prd_id` int NOT NULL AUTO_INCREMENT,
  `pr_id` int NOT NULL,
  `bg_type_id` int DEFAULT NULL,
  `prd_detail` varchar(45) DEFAULT NULL,
  `prd_budget` float DEFAULT NULL,
  `up_by` int DEFAULT NULL,
  `del` int DEFAULT '0',
  `create_date` date DEFAULT NULL,
  `update_date` date DEFAULT NULL,
  PRIMARY KEY (`prd_id`)
) ENGINE=InnoDB AUTO_INCREMENT=50 DEFAULT CHARSET=utf8mb4;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `pln_receive_detail`
--

LOCK TABLES `pln_receive_detail` WRITE;
/*!40000 ALTER TABLE `pln_receive_detail` DISABLE KEYS */;
INSERT INTO `pln_receive_detail` VALUES (1,1,2,'ครูเพ็ญ ช่วยออกงบ นร. เรียนดี',1000,31,1,'2022-07-21','2022-07-22'),(2,1,1,'MR. สมทบทุนค่าอาหารกลางวัน',2500,90,1,'2022-07-21','2022-07-22'),(3,1,6,'เงินประจำเครื่องแบบ นร.',5000,90,1,'2022-07-22','2022-07-22'),(4,2,5,'ค่าหนังสือประจำภาคเรียน',3000,90,1,'2022-07-26','2022-07-25'),(5,2,7,'ค่าอบรมนอกสถานศึกษา',5000,90,1,'2022-07-26','2022-07-25'),(6,2,2,'ค่าเรียรลูกเจ้าหน้าที่ทหาร',12000,90,1,'2022-07-26','2022-07-25'),(7,3,11,'ยอดยกมาจากปี 2564',450,90,1,'2022-12-31','2022-07-26'),(8,4,11,'บริจาก',500000,31,1,'2022-07-25','2022-08-02'),(9,5,4,'ทุนเรียนฟรี',5500,31,1,'2022-07-28','2022-07-29'),(10,5,2,'อุดหนุนนักเรียนรายหัวประจำปี 2565',25000,31,1,'2022-07-29','2022-07-29'),(11,4,2,'banaan',500,31,1,'2022-08-01','2022-08-01'),(12,4,1,'demo',150,31,1,'2022-08-01','2022-08-01'),(13,4,2,'demo',1500,31,1,'2022-08-01','2022-08-02'),(14,4,3,'DEMO',150,31,1,'2022-08-02','2022-08-02'),(15,6,1,'รับเงินอาหารกลางวัน',150,31,1,'2022-08-01','2022-08-02'),(16,8,2,' อุดหนุนรายหัว จาก สมหมาย',150,31,0,'2022-08-02','2022-08-03'),(17,9,2,'รับเงิน อุดหนุนรายหัว จาก สมพงษ์',160,31,1,'2022-08-02','2022-08-03'),(18,10,1,'รับเงิน ค่าอาหารกลางวัน จาก สมศัก',50,31,1,'2022-08-02','2022-08-03'),(19,11,1,'ค่าข้าว นร เรียนดี',15000,31,0,'2022-08-03','2022-08-04'),(20,11,2,'ค่าการศึกษา 2565',32000,31,0,'2022-08-03','2022-08-04'),(21,12,3,'ค่าที่พัก นร เรียนร่วม',10000,31,0,'2022-08-03','2022-08-04'),(22,12,2,'นร เรียนเด่นปี 2565',7000,31,0,'2022-08-04','2022-08-04'),(23,13,2,'เข้าค่ายพักแรม',4500,31,0,'2022-08-03','2022-08-04'),(24,14,2,'โครงการช่วยเหลือ นร ยากจน',2500,31,0,'2022-08-03','2022-08-04'),(25,15,15,'ดอกเบี้ยเงินเงินอุดหนุนทั่วไป',150,31,0,'2022-08-04','2022-08-05'),(26,16,15,'รับดอกเบี้ยเงินฝากโครงการอาหาร',500,31,0,'2022-08-04','2022-08-05'),(27,17,2,'ค่าเดินทางไปโรงเรียน',4700,90,0,'2022-08-06','2022-08-07'),(28,17,1,'นักเรียนดีเด่น 2565',2000,90,0,'2022-08-06','2022-08-07'),(29,18,5,'หนังสือเด็กยากจน 2565',15000,31,0,'2022-08-07','2022-08-09'),(30,18,2,'ออกสอบนอกสถานที่',25000,31,0,'2022-08-08','2022-08-09'),(31,19,7,'ไตรมาส1',100000,97,0,'2022-10-05','2022-10-06'),(32,19,2,'ไตรมาส1',100000,97,0,'2022-10-05','2022-10-06'),(33,20,2,'อุดหนุนรายหัว จาก สมหมาย',10000,108,0,'2022-10-09','2022-10-10'),(34,20,1,'ค่าอาหารจาก สมหมาย',5000,108,0,'2022-10-09','2022-10-10'),(35,21,1,'ค่าอารหารกลางวัน',3000,109,0,'2022-10-09','2022-10-10'),(36,22,1,'รับเงินค่าอาหารกลางวันจาก สมพงษ์',150,108,0,'2022-10-09','2022-10-10'),(37,23,7,'รับเงินค่า กิจกรรมพัฒนาผู้เรียนไตรมาศที่ 1/25',75000,97,0,'2022-10-20','2022-10-22'),(38,23,4,'รับเงิน ค่าอุปกรณ์ไตรมาศที่ 1/2566',55000,97,0,'2022-10-20','2022-10-22'),(39,23,2,'รับเงินไตรมาศที่ 1 /2566',250000,97,0,'2022-10-20','2022-10-22'),(40,24,4,'รับเงินสนับสนุน เรียนฟรี 15 ปี',1500,108,0,'2022-10-25','2022-10-26'),(41,25,15,'ดอกเงินฝาก',1200,110,0,'2022-10-27','2022-10-28'),(42,26,1,'งวดที่ 1',5000,98,0,'2022-11-15','2022-11-16'),(43,27,2,'รับเงินอุดหนุนจากสมชาย',50000,121,0,'2023-03-09','2023-03-10'),(44,28,7,'รับเิงนจาก demo',25000,120,0,'2023-03-12','2023-03-13'),(45,29,7,' เรียนฟรี 15 ปี -กิจกรรมพัฒนาผู้เรียน 1/66 งว',180000,133,0,'2023-03-13','2023-03-14'),(46,29,2,'เงินรายหัว 1/66 งวด 1 |  70%',380000,133,0,'2023-03-13','2023-03-14'),(47,30,2,'รับเงินสนันสนุน ประเภทอุดหนุนรายหัว จากอาจารย',3000,134,0,'2023-03-16','2023-03-17'),(48,31,7,'รับเงิน เรียนฟรี 15 ปี -กิจกรรมพัฒนาผู้เรียน ',500,134,0,'2023-03-16','2023-03-17'),(49,32,2,'รับเงินอุดหนุนรายหัวจากสมปอง',230,134,0,'2023-03-19','2023-03-20');
/*!40000 ALTER TABLE `pln_receive_detail` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2023-04-03  7:19:18
