-- MySQL dump 10.13  Distrib 8.0.32, for Win64 (x86_64)
--
-- Host: localhost    Database: sfmisystem
-- ------------------------------------------------------
-- Server version	8.0.32-0ubuntu0.22.04.2

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `area`
--

DROP TABLE IF EXISTS `area`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `area` (
  `areacode` varchar(10) NOT NULL,
  `area_type` int DEFAULT NULL,
  `area_name` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`areacode`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `area`
--

LOCK TABLES `area` WRITE;
/*!40000 ALTER TABLE `area` DISABLE KEYS */;
INSERT INTO `area` VALUES ('00100700',1,'สำนักบริหารงานการศึกษาพิเศษ'),('00101701',2,'สพม.เขต 1 (กทม.)'),('00101702',2,'สพม.เขต 2 (กทม.)'),('00101703',2,'สพม.เขต 3 (นนทบุรี-พระนครศรีอยุธยา)'),('00101704',2,'สพม.เขต 4 (ปทุมธานี-สระบุรี)'),('00101705',2,'สพม.เขต 5 (สิงห์บุรี-ลพบุรี-ชัยนาท-อ่างทอง)'),('00101706',2,'สพม.เขต 6 (ฉะเชิงเทรา-สมุทรปราการ)'),('00101707',2,'สพม.เขต 7 (ปราจีนบุรี-นครนายก-สระแก้ว)'),('00101708',2,'สพม.เขต 8 (ราชบุรี-กาญจนบุรี)'),('00101709',2,'สพม.เขต 9 (สุพรรณบุรี-นครปฐม)'),('00101710',2,'สพม.เขต 10 (เพชรบุรี-ประจวบฯ-สมุทรสงคราม-สมุทรสาคร)'),('00101711',2,'สพม.เขต 11 (สุราษฎร์ธานี-ชุมพร)'),('00101712',2,'สพม.เขต 12 (นครศรีธรรมราช-พัทลุง)'),('00101713',2,'สพม.เขต 13 (ตรัง-กระบี่)'),('00101714',2,'สพม.เขต 14 (พังงา-ภูเก็ต-ระนอง)'),('00101715',2,'สพม.เขต 15 (นราธิวาส-ปัตตานี-ยะลา)'),('00101716',2,'สพม.เขต 16 (สงขลา-สตูล)'),('00101717',2,'สพม.เขต 17 (จันทบุรี-ตราด)'),('00101718',2,'สพม.เขต 18 (ชลบุรี-ระยอง)'),('00101719',2,'สพม.เขต 19 (เลย-หนองบัวลําภู)'),('00101720',2,'สพม.เขต 20 (อุดรธานี)'),('00101721',2,'สพม.เขต 21 (หนองคาย-บึงกาฬ)'),('00101722',2,'สพม.เขต 22 (นครพนม-มุกดาหาร)'),('00101723',2,'สพม.เขต 23 (สกลนคร)'),('00101724',2,'สพม.เขต 24 (กาฬสินธุ์)'),('00101725',2,'สพม.เขต 25 (ขอนแก่น)'),('00101726',2,'สพม.เขต 26 (มหาสารคาม)'),('00101727',2,'สพม.เขต 27 (ร้อยเอ็ด)'),('00101728',2,'สพม.เขต 28 (ศรีสะเกษ-ยโสธร)'),('00101729',2,'สพม.เขต 29 (อุบลราชธานี-อํานาจเจริญ)'),('00101730',2,'สพม.เขต 30 (ชัยภูมิ)'),('00101731',2,'สพม.เขต 31 (นครราชสีมา)'),('00101732',2,'สพม.เขต 32 (บุรีรัมย์)'),('00101733',2,'สพม.เขต 33 (สุรินทร์)'),('00101734',2,'สพม.เขต 34 (เชียงใหม่-แม่ฮ่องสอน)'),('00101735',2,'สพม.เขต 35 (ลำปาง-ลำพูน)'),('00101736',2,'สพม.เขต 36 (เชียงราย และพะเยา)'),('00101737',2,'สพม.เขต 37 (แพร่-น่าน)'),('00101738',2,'สพม.เขต 38 (สุโขทัย-ตาก)'),('00101739',2,'สพม.เขต 39 (พิษณุโลก-อุตรดิตถ์)'),('00101740',2,'สพม.เขต 40 (เพชรบูรณ์)'),('00101741',2,'สพม.เขต 41 (กําแพงเพชร-พิจิตร)'),('00101742',2,'สพม.เขต 42 (นครสวรรค์-อุทัยธานี)'),('10010000',3,'สพป.กรุงเทพมหานคร'),('11010000',3,'สพป.สมุทรปราการ เขต 1'),('11020000',3,'สพป.สมุทรปราการ เขต 2'),('12010000',3,'สพป.นนทบุรี เขต 1'),('12020000',3,'สพป.นนทบุรี เขต 2'),('13010000',3,'สพป.ปทุมธานี เขต 1'),('13020000',3,'สพป.ปทุมธานี เขต 2'),('14010000',3,'สพป.พระนครศรีอยุธยา เขต 1'),('14020000',3,'สพป.พระนครศรีอยุธยา เขต 2'),('15010000',3,'สพป.อ่างทอง'),('16010000',3,'สพป.ลพบุรี เขต 1'),('16020000',3,'สพป.ลพบุรี เขต 2'),('17010000',3,'สพป.สิงห์บุรี'),('18010000',3,'สพป.ชัยนาท'),('19010000',3,'สพป.สระบุรี เขต 1'),('19020000',3,'สพป.สระบุรี เขต 2'),('20010000',3,'สพป.ชลบุรี เขต 1'),('20020000',3,'สพป.ชลบุรี เขต 2'),('20030000',3,'สพป.ชลบุรี เขต 3'),('21010000',3,'สพป.ระยอง เขต 1'),('21020000',3,'สพป.ระยอง เขต 2'),('22010000',3,'สพป.จันทบุรี เขต 1'),('22020000',3,'สพป.จันทบุรี เขต 2'),('23010000',3,'สพป.ตราด'),('24010000',3,'สพป.ฉะเชิงเทรา เขต 1'),('24020000',3,'สพป.ฉะเชิงเทรา เขต 2'),('25010000',3,'สพป.ปราจีนบุรี เขต 1'),('25020000',3,'สพป.ปราจีนบุรี เขต 2'),('26010000',3,'สพป.นครนายก'),('27010000',3,'สพป.สระแก้ว เขต 1'),('27020000',3,'สพป.สระแก้ว เขต 2'),('30010000',3,'สพป.นครราชสีมา เขต 1'),('30020000',3,'สพป.นครราชสีมา เขต 2'),('30030000',3,'สพป.นครราชสีมา เขต 3'),('30040000',3,'สพป.นครราชสีมา เขต 4'),('30050000',3,'สพป.นครราชสีมา เขต 5'),('30060000',3,'สพป.นครราชสีมา เขต 6'),('30070000',3,'สพป.นครราชสีมา เขต 7'),('31010000',3,'สพป.บุรีรัมย์ เขต 1'),('31020000',3,'สพป.บุรีรัมย์ เขต 2'),('31030000',3,'สพป.บุรีรัมย์ เขต 3'),('31040000',3,'สพป.บุรีรัมย์ เขต 4'),('32010000',3,'สพป.สุรินทร์ เขต 1'),('32020000',3,'สพป.สุรินทร์ เขต 2'),('32030000',3,'สพป.สุรินทร์ เขต 3'),('33010000',3,'สพป.ศรีสะเกษ เขต 1'),('33020000',3,'สพป.ศรีสะเกษ เขต 2'),('33030000',3,'สพป.ศรีสะเกษ เขต 3'),('33040000',3,'สพป.ศรีสะเกษ เขต 4'),('34010000',3,'สพป.อุบลราชธานี เขต 1'),('34020000',3,'สพป.อุบลราชธานี เขต 2'),('34030000',3,'สพป.อุบลราชธานี เขต 3'),('34040000',3,'สพป.อุบลราชธานี เขต 4'),('34050000',3,'สพป.อุบลราชธานี เขต 5'),('35010000',3,'สพป.ยโสธร เขต 1'),('35020000',3,'สพป.ยโสธร เขต 2'),('36010000',3,'สพป.ชัยภูมิ เขต 1'),('36020000',3,'สพป.ชัยภูมิ เขต 2'),('36030000',3,'สพป.ชัยภูมิ เขต 3'),('37010000',3,'สพป.อำนาจเจริญ'),('38010000',3,'สพป.บึงกาฬ'),('39010000',3,'สพป.หนองบัวลำภู เขต 1'),('39020000',3,'สพป.หนองบัวลำภู เขต 2'),('40010000',3,'สพป.ขอนแก่น เขต 1'),('40020000',3,'สพป.ขอนแก่น เขต 2'),('40030000',3,'สพป.ขอนแก่น เขต 3'),('40040000',3,'สพป.ขอนแก่น เขต 4'),('40050000',3,'สพป.ขอนแก่น เขต 5'),('41010000',3,'สพป.อุดรธานี เขต 1'),('41020000',3,'สพป.อุดรธานี เขต 2'),('41030000',3,'สพป.อุดรธานี เขต 3'),('41040000',3,'สพป.อุดรธานี เขต 4'),('42010000',3,'สพป.เลย เขต 1'),('42020000',3,'สพป.เลย เขต 2'),('42030000',3,'สพป.เลย เขต 3'),('43010000',3,'สพป.หนองคาย เขต 1'),('43020000',3,'สพป.หนองคาย เขต 2'),('44010000',3,'สพป.มหาสารคาม เขต 1'),('44020000',3,'สพป.มหาสารคาม เขต 2'),('44030000',3,'สพป.มหาสารคาม เขต 3'),('45010000',3,'สพป.ร้อยเอ็ด เขต 1'),('45020000',3,'สพป.ร้อยเอ็ด เขต 2'),('45030000',3,'สพป.ร้อยเอ็ด เขต 3'),('46010000',3,'สพป.กาฬสินธุ์ เขต 1'),('46020000',3,'สพป.กาฬสินธุ์ เขต 2'),('46030000',3,'สพป.กาฬสินธุ์ เขต 3'),('47010000',3,'สพป.สกลนคร เขต 1'),('47020000',3,'สพป.สกลนคร เขต 2'),('47030000',3,'สพป.สกลนคร เขต 3'),('48010000',3,'สพป.นครพนม เขต 1'),('48020000',3,'สพป.นครพนม เขต 2'),('49010000',3,'สพป.มุกดาหาร'),('50010000',3,'สพป.เชียงใหม่ เขต 1'),('50020000',3,'สพป.เชียงใหม่ เขต 2'),('50030000',3,'สพป.เชียงใหม่ เขต 3'),('50040000',3,'สพป.เชียงใหม่ เขต 4'),('50050000',3,'สพป.เชียงใหม่ เขต 5'),('50060000',3,'สพป.เชียงใหม่ เขต 6'),('51010000',3,'สพป.ลำพูน เขต 1'),('51020000',3,'สพป.ลำพูน เขต 2'),('52010000',3,'สพป.ลำปาง เขต 1'),('52020000',3,'สพป.ลำปาง เขต 2'),('52030000',3,'สพป.ลำปาง เขต 3'),('53010000',3,'สพป.อุตรดิตถ์ เขต 1'),('53020000',3,'สพป.อุตรดิตถ์ เขต 2'),('54010000',3,'สพป.แพร่ เขต 1'),('54020000',3,'สพป.แพร่ เขต 2'),('55010000',3,'สพป.น่าน เขต 1'),('55020000',3,'สพป.น่าน เขต 2'),('56010000',3,'สพป.พะเยา เขต 1'),('56020000',3,'สพป.พะเยา เขต 2'),('57010000',3,'สพป.เชียงราย เขต 1'),('57020000',3,'สพป.เชียงราย เขต 2'),('57030000',3,'สพป.เชียงราย เขต 3'),('57040000',3,'สพป.เชียงราย เขต 4'),('58010000',3,'สพป.แม่ฮ่องสอน เขต 1'),('58020000',3,'สพป.แม่ฮ่องสอน เขต 2'),('60010000',3,'สพป.นครสวรรค์ เขต 1'),('60020000',3,'สพป.นครสวรรค์ เขต 2'),('60030000',3,'สพป.นครสวรรค์ เขต 3'),('61010000',3,'สพป.อุทัยธานี เขต 1'),('61020000',3,'สพป.อุทัยธานี เขต 2'),('62010000',3,'สพป.กำแพงเพชร เขต 1'),('62020000',3,'สพป.กำแพงเพชร เขต 2'),('63010000',3,'สพป.ตาก เขต 1'),('63020000',3,'สพป.ตาก เขต 2'),('64010000',3,'สพป.สุโขทัย เขต 1'),('64020000',3,'สพป.สุโขทัย เขต 2'),('65010000',3,'สพป.พิษณุโลก เขต 1'),('65020000',3,'สพป.พิษณุโลก เขต 2'),('65030000',3,'สพป.พิษณุโลก เขต 3'),('66010000',3,'สพป.พิจิตร เขต 1'),('66020000',3,'สพป.พิจิตร เขต 2'),('67010000',3,'สพป.เพชรบูรณ์ เขต 1'),('67020000',3,'สพป.เพชรบูรณ์ เขต 2'),('67030000',3,'สพป.เพชรบูรณ์ เขต 3'),('70010000',3,'สพป.ราชบุรี เขต 1'),('70020000',3,'สพป.ราชบุรี เขต 2'),('71010000',3,'สพป.กาญจนบุรี เขต 1'),('71020000',3,'สพป.กาญจนบุรี เขต 2'),('71030000',3,'สพป.กาญจนบุรี เขต 3'),('71040000',3,'สพป.กาญจนบุรี เขต 4'),('72010000',3,'สพป.สุพรรณบุรี เขต 1'),('72020000',3,'สพป.สุพรรณบุรี เขต 2'),('72030000',3,'สพป.สุพรรณบุรี เขต 3'),('73010000',3,'สพป.นครปฐม เขต 1'),('73020000',3,'สพป.นครปฐม เขต 2'),('74010000',3,'สพป.สมุทรสาคร'),('75010000',3,'สพป.สมุทรสงคราม'),('76010000',3,'สพป.เพชรบุรี เขต 1'),('76020000',3,'สพป.เพชรบุรี เขต 2'),('77010000',3,'สพป.ประจวบคีรีขันธ์ เขต 1'),('77020000',3,'สพป.ประจวบคีรีขันธ์ เขต 2'),('80010000',3,'สพป.นครศรีธรรมราช เขต 1'),('80020000',3,'สพป.นครศรีธรรมราช เขต 2'),('80030000',3,'สพป.นครศรีธรรมราช เขต 3'),('80040000',3,'สพป.นครศรีธรรมราช เขต 4'),('81010000',3,'สพป.กระบี่'),('82010000',3,'สพป.พังงา'),('83010000',3,'สพป.ภูเก็ต'),('84010000',3,'สพป.สุราษฎร์ธานี เขต 1'),('84020000',3,'สพป.สุราษฎร์ธานี เขต 2'),('84030000',3,'สพป.สุราษฎร์ธานี เขต 3'),('85010000',3,'สพป.ระนอง'),('86010000',3,'สพป.ชุมพร เขต 1'),('86020000',3,'สพป.ชุมพร เขต 2'),('90010000',3,'สพป.สงขลา เขต 1'),('90020000',3,'สพป.สงขลา เขต 2'),('90030000',3,'สพป.สงขลา เขต 3'),('91010000',3,'สพป.สตูล'),('92010000',3,'สพป.ตรัง เขต 1'),('92020000',3,'สพป.ตรัง เขต 2'),('93010000',3,'สพป.พัทลุง เขต 1'),('93020000',3,'สพป.พัทลุง เขต 2'),('94010000',3,'สพป.ปัตตานี เขต 1'),('94020000',3,'สพป.ปัตตานี เขต 2'),('94030000',3,'สพป.ปัตตานี เขต 3'),('95010000',3,'สพป.ยะลา เขต 1'),('95020000',3,'สพป.ยะลา เขต 2'),('95030000',3,'สพป.ยะลา เขต 3'),('96010000',3,'สพป.นราธิวาส เขต 1'),('96020000',3,'สพป.นราธิวาส เขต 2'),('96030000',3,'สพป.นราธิวาส เขต 3');
/*!40000 ALTER TABLE `area` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2023-04-03  7:17:21
