-- MySQL dump 10.13  Distrib 8.0.32, for Win64 (x86_64)
--
-- Host: localhost    Database: sfmisystem
-- ------------------------------------------------------
-- Server version	8.0.32-0ubuntu0.22.04.2

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `master_moe_policy`
--

DROP TABLE IF EXISTS `master_moe_policy`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `master_moe_policy` (
  `id` int NOT NULL AUTO_INCREMENT,
  `moe_policy` text CHARACTER SET utf8mb3 COLLATE utf8mb3_unicode_ci NOT NULL,
  `up_by` int DEFAULT NULL,
  `del` int DEFAULT '0',
  `create_date` datetime DEFAULT NULL,
  `update_date` datetime DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=14 DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `master_moe_policy`
--

LOCK TABLES `master_moe_policy` WRITE;
/*!40000 ALTER TABLE `master_moe_policy` DISABLE KEYS */;
INSERT INTO `master_moe_policy` VALUES (1,'1.การปรับปรุงหลักสูตรและกระบวนการเรียนรู้ให้ทันสมัย และทันการเปลี่ยนแปลงของโลกในศตวรรษที่ 21 โดยมุ่งพัฒนาผู้เรียนทุกระดับการศึกษาให้มีความรู้ ทักษะและคุณลักษณะที่เหมาะสมกับบริบทสังคมไทย',1,0,'2022-04-29 05:44:32','2022-04-29 05:45:07'),(2,'2.การพัฒนาคุณภาพและประสิทธิภาพครูและอาจารย์ในระดับการศึกษาขั้นพื้นฐานและอาชีวศึกษา ให้มีสมรรถนะทางภาษาและดิจิทัล เพื่อให้ครูและอาจารย์ใด้รับการพัฒนาให้มีสมรรถนะทั้งด้านการจัดการเรียนรู้ ด้วยภาษาและดิจิทัล สามารถปรับวิธีการเรียนการสอนและการใช้สื่อทันสมัย และ',1,0,'2022-04-29 05:44:32','2022-04-29 05:45:07'),(3,'3.การปฏิรูปการเรียนรู้ด้วยดิจิทัลฝานแพลตฟอร์มการเรียนรู้ด้วยดิจิทัลแห่งชาติ (NDLP) และการส่งเสริมการฝึกทักษะดิจิทัลในชีวิตประจำวัน เพื่อให้มีหน่วยงานรับผิดชอบพัฒนาแพลตฟอร์มการเรียนรู้ด้วยดิจิทัลแห่งชาติ ที่สามารถนำไปใช้ในกระบวนการจัดการเรียนรู้ที่ทันสมัยและ',1,0,'2022-04-29 05:44:32','2022-04-29 05:45:07'),(4,'4.การพัฒนาประสิทธิภาพการบริหารและการจัดการศึกษา โดยการส่งเสริมสนับสนุนสถานศึกษาให้มีความเป็นอิสระและคล่องตัว การกระจายอำนาจการบริหารและการจัดการศึกษาโดยใช้จังหวัดเป็นฐาน โดยอาศัยอำนาจตามกฎหมายการศึกษาแห่งชาติที่ได้รับการปรับปรุงเพื่อกำหนดให้มีระบบบริหารและก',1,0,'2022-04-29 05:44:32','2022-04-29 05:45:07'),(5,'5.การปรับระบบการประเมินผลการศึกษาและการประกันคุณภาพ พร้อมจัดทดสอบวัดความรู้ และทักษะที่จำเป็นในการศึกษาต่อระดับอุดมศึกษาทั้งสายวิชาการและสายวิชาชีพ เพื่อให้ระบบการประเมินผลการศึกษาทุกระดับและระบบการประกันคุณภาพการศึกษา ได้รับการปรับปรุงให้ทันสมัย ตอบสนองผลล',1,0,'2022-04-29 05:44:32','2022-04-29 05:45:07'),(6,'6.การจัดสรรและการกระจายทรัพยากรให้ทั่วถึงทุกกลุ่มเป้าหมาย รวมถึงการระดมทรัพยากรทางการศึกษาจากความร่วมมือทุกภาคส่วน เพื่อให้การจัดสรรทรัพยากรทางการศึกษามีความเป็นธรรมและสร้างโอกาสให้กลุ่มเป้าหมายได้เข้าถึงการศึกษาที่มีคุณภาพทัดเทียมกลุ่มอื่น ๆ กระจายทรัพยากร',1,0,'2022-04-29 05:44:32','2022-04-29 05:45:07'),(7,'7.การนำกรอบคุณวุฒิแห่งชาติ (NQF) และกรอบคุณวุฒิอ้างอิงอาเซียน (AQRF) สู่การปฏิบัติ เป็นการผลิตและการพัฒนากำลังคนเพื่อการพัฒนาประเทศ โดยใช้กรอบคุณวุฒิแห่งชาติ เชื่อมโยงระบบการศึกษาและการอาชีพ โดยใช้กลไกการเทียบโอนประสบการณ์ด้วยธนาคารหน่วยกิตและการจัดทำมาตรฐานอาชีพในสาขาที่สามารถอ้างอิงอาเซียนได้',1,0,'2022-04-29 05:44:32','2022-04-29 05:45:07'),(8,'8.การพัฒนาเด็กปฐมวัยให้ได้รับการดูแลและพัฒนาก่อนเข้ารับการศึกษาเพื่อพัฒนาร่างกาย จิตใจวินัย อารมณ์ สังคม และสติปัญญาให้สมกับวัย เพื่อเป็นการขับเคลื่อนแผนบูรณาการการพัฒนาเด็กปฐมวัย ตามพระราชบัญญัติการพัฒนาเด็กปฐมวัย พ.ศ. 2562 สู่การปฏิบัติเป็นรูปธรรม โดยหน่วยงานที่เกี่ยวข้องนำไปเป็นกรอบในการจัดทำแผนปฏิบัติการเพื่อพัฒนาเด็กปฐมวัย และมีการติดตามความก้าวหน้าเป็นระยะ',1,0,'2022-04-29 05:44:32','2022-04-29 05:45:07'),(9,'9.การศึกษาเพื่ออาชีพและสร้างขีดความสามารถในการแข่งขันของประเทศ เพื่อให้ผู้จบการศึกษาระดับปริญญาและอาชีวศึกษามีอาชีพและรายได้ที่เหมาะสมกับการดำรงชีพและคุณภาพชีวิตที่ดีมีส่วนช่วยเพิ่มขีดความสามารถในการแข่งขันในเวทีโลกได้',1,0,'2022-04-29 05:44:32','2022-04-29 05:45:07'),(10,'10.การพลิกโฉมระบบการศึกษาไทยด้วยการนำนวัตกรรมและเทคโนโลยีที่ทันสมัยมาใช้ในการจัดการศึกษาทุกระดับการศึกษา เพื่อให้สถาบันการศึกษาทุกแห่งนำนวัตกรรมและเทคโนโลยีที่ทันสมัยมาใช้ในการจัดการศึกษาผ่านระบบดิจิทัล',1,0,'2022-04-29 05:44:32','2022-04-29 05:45:07'),(11,'11.การเพิ่มโอกาสและการเข้าถึงการศึกษาที่มีคุณภาพของกลุ่มผู้ด้อยโอกาสทางการศึกษา และผู้เรียนที่มีความต้องการจำเป็นพิเศษ เพื่อเป็นการเพิ่มโอกาสและการเข้าถึงการศึกษาที่มีคุณภาพของกลุ่มผู้ด้อยโอกาสทางการศึกษา และผู้เรียนที่มีความต้องการจำเป็นพิเศษ',1,0,'2022-04-29 05:44:32','2022-04-29 05:45:07'),(12,'12.การจัดการศึกษาในระบบ นอกระบบ และตามอัธยาศัย โดยยึดหลักการเรียนรู้ตลอดชีวิตและการมีส่วนร่วมของผู้มีส่วนเกี่ยวข้อง เพื่อเพิ่มโอกาสและการเข้าถึงการศึกษาที่มีคุณภาพของกลุ่มผู้ด้อยโอกาสทางการศึกษาและผู้เรียนที่มีความต้องการจำเป็นพิเศษ',1,0,'2022-04-29 05:44:32','2022-04-29 07:08:20'),(13,'demo',1,1,'2022-04-29 07:08:31','2022-04-29 07:08:31');
/*!40000 ALTER TABLE `master_moe_policy` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2023-04-03  7:17:36
