-- MySQL dump 10.13  Distrib 8.0.32, for Win64 (x86_64)
--
-- Host: localhost    Database: sfmisystem
-- ------------------------------------------------------
-- Server version	8.0.32-0ubuntu0.22.04.2

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `request_withdraw`
--

DROP TABLE IF EXISTS `request_withdraw`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `request_withdraw` (
  `rw_id` int NOT NULL AUTO_INCREMENT,
  `sc_id` int DEFAULT '0',
  `no_doc` varchar(45) DEFAULT NULL,
  `payment_type` int DEFAULT '0' COMMENT 'ประเภทเงินที่ได้จ่าย\n1. ค่าวัสดุ\n2. ค่าจ้างทำของ\n3. ค่าบริการ',
  `bg_type_id` int DEFAULT '0',
  `rw_type` int DEFAULT '0' COMMENT '1 = เงินยืม| 2 = ค่าเดินทาง| 3 = ค่าพัสดุบริการ|',
  `order_id` int DEFAULT '0' COMMENT 'key จาก  pacel_order จะมีค่าเมื่อเลือกประเภทขอเบิกเป็น วัสดุ/อุปกรณ์',
  `p_id` int DEFAULT '0' COMMENT 'p_id key จะมาจาก partner จะมีเค่าเมื่อเลือกประเภทขอเบิกเป็น วัสดุ/อุปกรณ์',
  `detail` text,
  `amount` float DEFAULT '0',
  `certificate_payment` int DEFAULT '1' COMMENT '1 บค\\n2 บจ',
  `date_request` date DEFAULT NULL,
  `user_request_head` int DEFAULT '0',
  `user_request` int DEFAULT '0',
  `user_offer_check` int DEFAULT '0',
  `receipt_number` varchar(50) DEFAULT NULL COMMENT 'เลขที่ใบสำคัญคู่จ่าย/เลขใบเสร็จ',
  `receipt_picture` text COMMENT 'รูปใบสำคัญคู่จ่าย/รูปใบเสร็จ ',
  `offer_check_date` date DEFAULT NULL,
  `check_no_doc` varchar(45) DEFAULT NULL,
  `type_offer_check` int DEFAULT '0' COMMENT '1 = บค | 2 = บจ',
  `status` int DEFAULT '0' COMMENT '0 = กำลังทำ | 100 = ส่งหัวหน้าการเงิน | 101 = หัวหน้าไม่อนุมัติ| 102 = หัวหน้าอนุมัติ| 200 = ผอ. อนุมัติ | 201 = ยกเลิกเช็ค | 202 = ออกเช็ค',
  `remark` text,
  `sy_id` int DEFAULT '0',
  `year` varchar(45) DEFAULT NULL,
  `up_by` int DEFAULT '0',
  `del` int DEFAULT '0',
  `create_date` datetime DEFAULT NULL,
  `update_date` datetime DEFAULT NULL,
  PRIMARY KEY (`rw_id`)
) ENGINE=InnoDB AUTO_INCREMENT=55 DEFAULT CHARSET=utf8mb4;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `request_withdraw`
--

LOCK TABLES `request_withdraw` WRITE;
/*!40000 ALTER TABLE `request_withdraw` DISABLE KEYS */;
INSERT INTO `request_withdraw` VALUES (1,1,'1001',0,2,3,2,3,'ขอทำเรื่องจัดซื้อของทำโครงการ สส.2565',3000,1,'2022-07-20',31,31,90,NULL,NULL,'2022-08-02','1',1,201,'',14,'2565',31,0,'2022-07-21 09:17:46','2022-08-03 05:07:30'),(2,1,'1002',0,2,3,2,2,'ขอทำเรื่องจัดซื้อของทำโครงการ สส.2565',3000,2,'2022-07-22',31,31,31,NULL,NULL,'2022-08-02','2',1,201,'',14,'2565',31,0,'2022-07-21 09:31:18','2022-08-03 05:10:18'),(3,1,'44/32',0,1,2,0,3,'ไปเยี่ยมชมแหล่งท่องเทียวทางประวัติศาสตร์',700,1,'2022-07-25',31,31,31,NULL,NULL,'2022-08-02','3',1,201,'',14,'2565',31,0,'2022-07-26 03:30:15','2022-08-03 09:47:43'),(4,1,'AC-336/2565',0,1,2,0,3,'ค่าอาหารให้นักเรียนยากจนประจำปี 1/2565',200,2,'2022-07-25',31,90,31,NULL,NULL,'2022-08-09','4',1,201,'',14,'2565',31,0,'2022-07-26 08:21:05','2022-08-03 09:47:45'),(5,1,'123',0,1,2,0,3,'ขอเบิกงบ',500,2,'2022-07-25',31,31,90,NULL,NULL,'2022-08-02','5',2,201,'',14,'2565',31,0,'2022-07-26 09:53:36','2022-08-03 09:47:47'),(6,1,'125',0,5,3,1,4,'ชอเบิกงบ',150,1,'2022-07-28',31,90,90,NULL,NULL,'2022-08-01','6',1,201,'',14,'2565',31,0,'2022-07-29 06:59:18','2022-08-03 09:47:51'),(7,1,'บ2/2565',0,1,2,0,3,'เบิกค่าเดินทาง',507,1,'2022-07-28',31,90,31,NULL,NULL,'2022-08-02','7',2,201,'',14,'2565',31,0,'2022-07-29 09:08:58','2022-08-03 09:47:54'),(8,1,'รร.36/2565',0,2,3,2,4,'ขอทำเรื่องจัดซื้อของทำโครงการ สส.2565',3000,1,'2022-08-01',31,90,31,NULL,NULL,'2022-08-02','8',2,201,'',14,'2565',31,0,'2022-08-02 04:28:48','2022-08-03 09:47:56'),(9,1,'Face-52',0,2,3,2,4,'ขอทำเรื่องจัดซื้อของทำโครงการ สส.2565',3000,2,'2022-08-02',0,31,90,NULL,NULL,'2022-08-02','9',2,201,'',14,'2565',31,0,'2022-08-03 10:15:06','2022-08-04 05:41:36'),(10,1,'ABC-1234',0,2,3,2,3,'ขอทำเรื่องจัดซื้อของทำโครงการ สส.2565',3000,1,'2022-08-03',0,90,31,'444331','assets/img/receipt_picture/receipt_pic10082022_116.png','2022-08-03','10',2,202,'',14,'2565',31,0,'2022-08-04 05:42:12','2022-08-10 09:13:10'),(11,1,'AA-330',0,2,3,1,3,'ชอเบิกงบ',150,1,'2022-08-03',0,31,90,'1212312121','assets/img/receipt_picture/receipt_pic10082022_224.png','2022-08-03','11',2,202,'',14,'2565',31,0,'2022-08-04 08:09:33','2022-08-10 07:15:57'),(12,1,'ABC-1414',0,3,2,0,2,'เข้าค่ายพักเเรม',500,1,'2022-08-03',0,90,90,NULL,NULL,'2022-08-03','12',1,202,'',14,'2565',31,0,'2022-08-04 09:44:27','2022-08-04 09:45:19'),(13,1,'กก-454',0,2,3,2,4,'ขอทำเรื่องจัดซื้อของทำโครงการ สส.2565',3000,1,'2022-08-06',31,31,31,NULL,NULL,'2022-08-06','13',1,202,'',14,'2565',90,0,'2022-08-07 03:06:28','2022-08-07 03:12:31'),(14,1,'บก003/2565',0,2,3,2,2,'ขอทำเรื่องจัดซื้อของทำโครงการ สส.2565',3000,1,'2022-08-08',0,90,90,NULL,NULL,'2022-08-08','14',1,202,'',14,'2565',90,0,'2022-08-09 03:01:28','2022-08-09 03:08:10'),(15,1,'SD-002',0,2,3,1,3,'ชอเบิกงบ',150,2,'2022-08-10',31,31,31,NULL,NULL,'2022-08-23','1',0,202,'',14,'2565',31,0,'2022-08-10 03:33:24','2022-08-24 07:49:01'),(16,1,'กขข16200',0,2,3,2,4,'ขอทำเรื่องจัดซื้อของทำโครงการ สส.2565',3000,2,'2022-08-10',0,31,31,'1/2565','assets/img/receipt_picture/receipt_pic24082022_133.jpeg','2022-08-10','20',0,202,'',14,'2565',31,0,'2022-08-10 11:00:06','2022-08-24 07:51:15'),(17,1,'1/2',0,2,3,7,3,'ค่าเครื่องเขียน',1850,2,'2022-08-24',0,90,0,NULL,NULL,NULL,NULL,0,102,'',14,'2565',31,0,'2022-08-24 07:47:23','2022-08-24 07:50:03'),(18,1,'m-142',0,5,3,9,4,'ขอเบิกงบย่อย รอบสามม',3000,2,'2022-08-25',0,90,0,NULL,NULL,NULL,NULL,0,102,'',14,'2565',31,0,'2022-08-25 05:51:55','2022-08-26 07:43:34'),(19,1,'พพ02/2565',0,2,3,12,4,'ซื้ออุปกรณ์การเรียน ห้องอนุบาล',1500,2,'2022-09-02',0,90,90,'บจ 8/2565','assets/img/receipt_picture/receipt_pic02092022_83.jpeg','2022-09-04','555666',0,202,'',14,'2565',31,0,'2022-09-02 07:45:06','2022-09-02 08:06:29'),(20,1,'banana123',0,5,3,10,4,'.ขอเบิกงบย่อย รอบ4',4000,2,'2022-09-05',0,31,31,NULL,NULL,'2022-09-05','12313132',0,202,'',14,'2565',90,0,'2022-09-05 16:21:06','2022-09-05 16:24:37'),(21,1,'กกๅ130',0,2,2,0,7,'ขอเบิกเดินทางไปราชการ',1222,1,'2022-09-05',0,31,90,NULL,NULL,'2022-09-09','12313133',0,202,'',14,'2565',90,0,'2022-09-05 16:30:35','2022-09-05 16:33:59'),(22,1,'1001',0,2,3,13,4,'เบิกทดสอบโครงการย่อย',500,2,'2022-09-04',31,31,0,NULL,NULL,NULL,NULL,0,100,'',14,'2565',90,0,'2022-09-05 16:41:54','2022-09-05 16:59:42'),(23,1,'wdwd',0,2,1,0,7,'เบิกอุปกรณ์การเรียน',7777,1,'2022-09-05',0,31,31,NULL,NULL,'2022-09-10','12313134',0,202,'',14,'2565',90,0,'2022-09-05 17:05:26','2022-09-05 17:06:21'),(24,1,'กข150',0,2,2,0,7,'เบิก',299,1,'2022-09-05',0,31,31,NULL,NULL,'2022-09-20','1242234',0,202,'',14,'2565',90,0,'2022-09-05 17:15:44','2022-09-05 17:25:41'),(25,1,'10023',0,2,3,20,3,'จัดซื้ออุปกรณ์การศึกษา',2000,2,'2022-09-08',31,31,31,NULL,NULL,'2022-09-16','30',0,202,'',14,'2565',31,0,'2022-09-09 14:45:30','2022-09-09 15:02:54'),(26,1,'บย.1/2565',0,1,1,0,7,'ค่าอาหารกลางวัน 2565',10000,1,'2022-09-09',0,90,31,NULL,NULL,'2022-09-20','31',0,202,'',14,'2565',90,0,'2022-09-09 15:52:25','2022-09-20 14:52:15'),(27,1,'INSOM17',0,1,1,0,0,'เงินยืมโครงการอาหารกลางวัน-อินสม',15000,1,'2022-09-17',31,90,0,NULL,NULL,NULL,NULL,0,200,'',14,'2565',85,0,'2022-09-17 09:49:48','2022-09-17 09:51:03'),(28,2,'001/2566',0,2,3,29,12,'ซื้อพัสดุโครงการ',3001,2,'2022-10-06',97,97,97,'106','assets/img/receipt_picture/receipt_pic21102022_145.jpeg','2022-10-21','13322155',0,202,'',21,'2565',97,0,'2022-10-06 16:43:02','2022-10-21 22:05:06'),(29,1,NULL,0,0,3,30,4,'จัดซื้อเต็นท์ สนาม',750,2,'2022-10-06',0,93,0,NULL,NULL,NULL,NULL,0,0,'',14,'2565',92,0,'2022-10-07 16:49:23','2022-10-07 16:49:23'),(30,11,'sc-001',0,2,3,31,13,'ซื้ออุกปรณ์เข้าค่ายครั้งที่ 1',1500,2,'2022-10-09',109,109,109,'98','assets/img/receipt_picture/receipt_pic10102022_286.jpeg','2022-10-12','1',0,202,'',21,'2565',109,0,'2022-10-10 15:03:17','2022-10-10 16:02:07'),(31,11,'201-a',0,2,3,32,14,'ซื้ออุกปรณ์เข้าค่ายครั้งที่ 2',5000,2,'2022-10-09',109,109,108,'100','assets/img/receipt_picture/receipt_pic10102022_210.jpeg','2022-10-10','2',0,202,'',21,'2565',108,0,'2022-10-10 15:03:26','2022-10-10 16:08:54'),(32,11,NULL,0,0,3,34,13,'จัดซื้ออุปกรณ์โครงการกีฬาสีครั้งที่ 1',2500,2,'2022-10-27',0,104,0,NULL,NULL,NULL,NULL,0,0,'',21,'2565',106,0,'2022-10-28 11:50:24','2022-10-28 11:50:24'),(33,11,NULL,0,1,3,35,13,'จ้างช่างมาทาสีห้องน้ำ',27500,2,'2022-10-27',0,107,0,NULL,NULL,NULL,NULL,0,0,'',21,'2565',106,0,'2022-10-28 11:50:35','2022-10-28 11:50:35'),(34,2,'01/2565',0,2,3,36,12,'อิอิอิ',10000,2,'2022-10-27',110,110,110,'112','assets/img/receipt_picture/receipt_pic06112022_527.jpeg','2022-10-28','1',0,202,'',21,'2565',97,0,'2022-10-28 14:12:10','2022-11-06 14:34:37'),(35,11,'Demo-123',1,1,3,37,14,'เงินสนับสนุนค่าอาหารเข้าค่าย',1000,2,'2022-10-30',109,108,0,NULL,NULL,NULL,NULL,0,102,'',21,'2565',109,0,'2022-11-01 12:24:47','2022-11-09 12:12:47'),(36,2,'wave-110',0,2,2,0,16,'กรณ์ มา ยืมเงิน',150,1,'2022-11-02',0,98,0,NULL,NULL,NULL,NULL,0,0,'',21,'2565',110,1,'2022-11-02 11:38:20','2022-11-02 11:42:21'),(37,11,'wave-110',3,2,1,0,15,'คุณครูพลวรรธน์ มนพัทธ์ มายืมเงิน',150,1,'2022-11-02',0,108,108,NULL,NULL,'2022-11-02','3',0,202,'',21,'2565',108,0,'2022-11-02 11:44:54','2022-11-02 11:48:34'),(38,11,'wave-100',3,1,3,37,14,'เงินสนับสนุนค่าอาหารเข้าค่าย',1000,2,'2022-11-02',0,108,108,NULL,NULL,'2022-11-02','4',0,202,'',21,'2565',108,0,'2022-11-02 11:46:57','2022-11-02 11:48:43'),(39,11,'qwd',1,1,3,37,14,'เงินสนับสนุนค่าอาหารเข้าค่าย',1000,2,'2022-11-02',109,108,0,NULL,NULL,NULL,NULL,0,0,'',21,'2565',108,0,'2022-11-02 12:21:57','2022-11-02 12:22:27'),(40,11,'AS-303',0,1,3,33,14,'ซื้ออุกปรณ์เข้าค่ายครั้งที่ 3/1',1000,2,'2022-10-09',109,108,0,NULL,NULL,NULL,NULL,0,0,'',21,'2565',108,0,'2022-11-03 11:22:05','2022-11-09 10:42:16'),(41,11,'DEMO-001',0,18,4,0,21,' นำส่ง หักภาษี ณ ที่จ่าย',71,2,'2022-11-09',109,108,0,NULL,NULL,NULL,NULL,0,0,'',21,'2565',108,1,'2022-11-09 10:24:15','2022-11-09 10:30:05'),(42,11,'DEMO002',0,18,4,0,20,'นำส่ง หักภาษี ณ ที่จ่าย',72.58,3,'2022-11-09',109,109,108,NULL,NULL,'2022-11-09','5',0,202,'',21,'2565',109,0,'2022-11-09 10:31:13','2022-11-09 12:03:29'),(43,11,'AA-301',3,1,2,0,15,'เบิกเดินทางไปราชการ 1/2565',7160,1,'2022-11-09',0,109,0,NULL,NULL,NULL,NULL,0,0,'',21,'2565',108,0,'2022-11-09 11:09:03','2022-11-09 11:09:03'),(44,11,'CC-003',0,18,4,0,20,'หักภาษี ณ ที่จ่าย 1/2',0.73,3,'2022-11-09',0,108,108,NULL,NULL,'2022-11-09','1',0,202,'',21,'2565',109,1,'2022-11-09 12:20:00','2022-11-09 12:33:24'),(45,2,'123/2565',1,2,3,40,19,'asdasasdsad',3000,2,'2022-11-14',110,98,98,NULL,NULL,'2022-11-16','2',0,202,'',21,'2565',98,0,'2022-11-15 17:05:13','2022-11-16 09:28:56'),(46,2,'124/2565',1,1,1,0,27,'โครงการอาหารกลางวัน',5000,1,'2022-11-16',110,98,0,NULL,NULL,NULL,NULL,0,0,'',21,'2565',97,0,'2022-11-16 09:47:14','2022-11-16 14:32:20'),(47,2,'111111',2,2,3,39,1,'ปรับปรุงสภาพแวดล้อม ปลูกไม้ดอกไม้ประดับ',10000,2,'2022-11-20',110,98,98,NULL,NULL,'2022-11-16','3',0,202,'',21,'2565',98,0,'2022-11-16 14:27:28','2022-11-16 14:35:07'),(48,11,NULL,0,0,3,41,26,'จัดซื้ออุปกรณ์ในกิจกรรมคริสมาสต์เดย์01',1500,2,'2022-11-16',0,104,0,NULL,NULL,NULL,NULL,0,0,'',21,'2565',106,0,'2022-11-17 10:57:40','2022-11-17 10:57:40'),(49,12,'bb-01',1,2,3,46,28,'ขอจัดซื้อ',20000,2,'2023-03-09',121,120,121,'135','assets/img/receipt_picture/receipt_pic10032023_650.jpeg','2023-03-10','1',0,202,'',1,'2566',121,0,'2023-03-10 16:22:26','2023-03-10 17:18:49'),(50,12,'b-001',1,7,3,52,28,'ขอจัดซื้ออุปกร์กีฬาสีครั้งที่ 1',5000,2,'2023-03-12',121,120,120,'138','assets/img/receipt_picture/receipt_pic13032023_741.jpeg','2023-03-13','2',0,202,'',1,'2566',120,0,'2023-03-13 12:15:52','2023-03-13 12:23:38'),(51,20,'1/2566',1,2,3,53,29,'ซื้อวัสดุประการอบรมครู',25000,2,'2023-03-16',134,133,133,NULL,NULL,'2023-03-16','1',0,202,'',1,'2566',133,0,'2023-03-14 16:27:27','2023-03-14 16:41:46'),(52,20,'2/2566',1,2,3,54,30,'กิจกรรมเข้าค่ายพักแรม 3วัน 2คืน',5000,2,'2023-03-15',134,134,134,NULL,NULL,'2023-03-23','2',0,202,'',1,'2566',134,0,'2023-03-16 15:53:57','2023-03-16 15:56:05'),(53,20,'bb-032',1,2,3,55,29,'ขอจัดซื้ออุปกรณ์ในโครงการสันทนาการเด็กๆ',7000,2,'2023-03-19',134,134,134,NULL,NULL,'2023-03-20','2',0,202,'',1,'2566',134,0,'2023-03-20 12:43:12','2023-03-20 12:46:00'),(54,20,'ิbbe-123',1,7,3,56,29,'จัดซื้อเครื่องถ่ายเอกสาร HP',2100,2,'2023-03-19',134,134,134,NULL,NULL,'2023-03-20','3',0,202,'',1,'2566',134,0,'2023-03-20 14:24:51','2023-03-20 14:26:12');
/*!40000 ALTER TABLE `request_withdraw` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2023-04-03  7:17:29
