-- MySQL dump 10.13  Distrib 8.0.32, for Win64 (x86_64)
--
-- Host: localhost    Database: sfmisystem
-- ------------------------------------------------------
-- Server version	8.0.32-0ubuntu0.22.04.2

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `tb_supplies`
--

DROP TABLE IF EXISTS `tb_supplies`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `tb_supplies` (
  `supp_id` int NOT NULL AUTO_INCREMENT,
  `supp_no` varchar(45) NOT NULL,
  `supp_img` text,
  `supp_name` varchar(250) NOT NULL,
  `supp_price` float DEFAULT NULL,
  `ts_id` int DEFAULT '0' COMMENT 'ประเภทวัสดุ',
  `un_id` int DEFAULT '0' COMMENT 'หน่วยนับ',
  `supp_detail` text,
  `supp_address` text,
  `supp_cap_max` int NOT NULL DEFAULT '1',
  `supp_cap_min` int NOT NULL DEFAULT '0',
  `sc_id` int DEFAULT NULL,
  `up_by` int DEFAULT NULL,
  `del` int DEFAULT '0',
  `create_date` datetime DEFAULT NULL,
  `update_date` datetime DEFAULT NULL,
  PRIMARY KEY (`supp_id`)
) ENGINE=InnoDB AUTO_INCREMENT=46 DEFAULT CHARSET=utf8mb4;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `tb_supplies`
--

LOCK TABLES `tb_supplies` WRITE;
/*!40000 ALTER TABLE `tb_supplies` DISABLE KEYS */;
INSERT INTO `tb_supplies` VALUES (1,'B-50',NULL,'กล่องโฟม',20,15,10,'กล่องขนาด XL','ห้องการคลัง',20,5,1,82,0,'2022-04-27 08:34:28','2022-08-25 09:22:10'),(2,'SC-200',NULL,'AX',20,2,5,'red color','C-12',10,5,1,31,1,'2022-04-27 08:35:45','2022-04-27 09:38:27'),(3,'C-001',NULL,'ดินสอ',10,2,10,'ปากกาแดง','ห้องพัสดุ',100,20,1,82,0,'2022-05-02 03:43:57','2022-08-25 09:17:14'),(4,'Aa-1234',NULL,'ยางลบ',5,2,3,'ยางลบดินสอ 2B','ห้อง 6/1',50,40,1,31,0,'2022-05-02 03:45:03','2022-05-02 03:45:03'),(5,'V-12',NULL,'สมุด',12,3,6,'สมุดปกแข็ง','ห้องครูใหญ่',10,5,1,31,0,'2022-05-02 03:45:53','2022-05-02 03:45:53'),(6,'AS-665','assets/img/supplie/supplie_05052022_233140_160.jpeg','หนังสือ',120,3,6,'หนังสือปกสี','ห้องสมุด',23,10,1,82,0,'2022-05-02 03:47:28','2022-05-05 23:31:40'),(7,'Q-552',NULL,'กล่อง XL',10,3,5,'กล่องใส่ดินสอ','ห้องพัสดุ',10,3,1,82,0,'2022-05-02 03:49:45','2022-05-03 12:25:39'),(8,'A-5','assets/img/supplie/supplie_04052022_102449_411.jpeg','จักรยาน',1000,3,4,'จักรยานสีแดง','โรงพละ',2,1,1,31,0,'2022-05-04 10:18:29','2022-05-04 10:24:49'),(9,'AK-47','assets/img/supplie/supplie_11052022_101503_773.jpeg','พัดลมตั้งโต๊ะ',50,3,12,'สีฟ้า','ห้องครู้ใหญ่',5,1,1,82,0,'2022-05-11 10:15:03','2022-05-11 10:15:03'),(10,'001','assets/img/supplie/supplie_11052022_142321_437.jpeg','เครื่องพิมพ์ความร้อน',50,3,12,'','',1,5,1,82,0,'2022-05-11 14:23:21','2022-05-11 14:23:21'),(11,'005','assets/img/supplie/supplie_14052022_182228_232.png','รถสามล้อไฟฟ้า',25000,3,12,'สำหรับส่งเอกกสาร','คลัง 1',1,0,1,82,0,'2022-05-14 18:22:28','2022-05-14 18:22:28'),(12,'005',NULL,'ทดสอบวัสดุ',0,0,0,'','',1,0,1,85,0,'2022-05-15 08:43:26','2022-05-15 08:43:26'),(13,'1',NULL,'กระดาษ A4',130,3,10,'','',1,0,1,82,0,'2022-06-16 01:51:49','2022-06-16 01:51:49'),(14,'001',NULL,'กระดาษเอสี่',2,0,0,'','',1,0,2,101,0,'2022-10-06 13:56:10','2022-10-06 13:56:10'),(15,'001',NULL,'กระดาษเอสี่',125,18,14,'ยี่ห้อ  AA ดับเบิ้ลเอ','ห้องพัสดุ',50,10,2,101,1,'2022-10-06 14:00:09','2022-10-06 14:14:17'),(16,'002',NULL,'ปากกา',5,18,15,'ตราม้า','ห้องพัสดุ',100,20,2,101,0,'2022-10-06 16:08:31','2022-10-06 16:08:31'),(17,'001',NULL,'กระดาษเอสี่',125,18,14,'ดับเบิ้ลเอ','ห้องพัสดุ',100,20,2,101,0,'2022-10-06 16:11:04','2022-10-06 16:11:04'),(18,'01',NULL,'ดินสอ',8,18,0,'ดินสอสำหรับนักเรียน ยี่ห้อ GG','',1,0,2,96,0,'2022-10-06 16:17:29','2022-10-06 16:17:29'),(19,'02',NULL,'ยางลบ',5,18,0,'ยี่ห้อ BB เนื้อยางลบสีขาว','',1,0,2,96,0,'2022-10-06 16:18:39','2022-10-06 16:18:39'),(20,'003',NULL,'ดินสอ',5,18,0,'','',1,0,2,101,0,'2022-10-06 16:19:36','2022-10-06 16:19:36'),(21,'03',NULL,'ยางลบ',5,18,0,'ยี่ห้อBB เนื้อยางลบสีขาว','',1,0,2,96,0,'2022-10-06 16:21:41','2022-10-06 16:21:41'),(22,'003',NULL,'สมุด',30,18,0,'ปกอ่อน','ห้องพัสดุ',100,20,2,101,0,'2022-10-06 16:21:42','2022-10-06 16:21:42'),(23,'003',NULL,'สมุด',20,18,18,'ปกอ่อน','ห้องพัสดุ',100,20,2,101,1,'2022-10-06 16:25:20','2022-10-06 16:25:20'),(24,'e20',NULL,'ดินน้ำมัน',20,15,3,'ดินน้ำมันน่ะ','',1,0,1,93,0,'2022-10-07 11:00:25','2022-10-07 11:00:25'),(25,'e20',NULL,'ดินน้ำมัน',20,15,3,'ดินน้ำมันน่ะ','',1,0,1,93,0,'2022-10-07 11:00:43','2022-10-07 11:00:43'),(26,'e20',NULL,'ดินน้ำมัน',20,15,3,'ดินน้ำมันน่ะ','',1,0,1,93,0,'2022-10-07 11:02:30','2022-10-07 11:02:30'),(27,'lex',NULL,'เครื่องยนต์',5000,17,12,'เครื่องยนต์','',1,0,1,93,0,'2022-10-07 11:04:37','2022-10-07 11:04:37'),(28,'023',NULL,'ดินเหนียว',10,17,3,'ดินนะ','',1,0,1,93,0,'2022-10-07 15:04:18','2022-10-07 15:04:18'),(29,'e85',NULL,'สมุด',15,15,6,'สมุดวาดเขียน','',1,0,1,93,0,'2022-10-07 15:11:18','2022-10-07 15:11:18'),(30,'gg01',NULL,'หนังสือสวดมน',5,15,6,'หนังสือสวดมนนะ','',1,0,1,93,0,'2022-10-07 15:14:26','2022-10-07 15:14:26'),(31,'tp012',NULL,'เต็นท์ สนาม',500,30,5,'เต็นท์ สนามน่ะ','',1,0,1,93,0,'2022-10-07 16:38:13','2022-10-07 16:38:13'),(32,'cmp-100',NULL,'เต็นท์ สนาม  ',500,30,19,'เต็นท์ สนาม แบบพับได้  ','',1,0,11,104,0,'2022-10-10 14:41:44','2022-10-10 14:41:44'),(33,'pp-300',NULL,'หนังสือสวดมนต์',100,15,6,'หนังสือสวดมนต์ เล่มใหญ่','',1,0,11,104,0,'2022-10-10 14:42:31','2022-10-10 14:42:31'),(34,'bye-99',NULL,'ดินน้ำมัน',50,30,3,'ดินน้ำมัน อย่างดี','',1,0,11,104,0,'2022-10-10 14:44:52','2022-10-10 14:44:52'),(35,'m-150',NULL,'จักรยาน',1000,30,12,'จักรยาน อย่างดี','',1,0,11,104,0,'2022-10-10 14:45:51','2022-10-10 14:45:51'),(36,'insom01',NULL,'กล้าไม้ดอก',50,25,0,'','',1,0,2,99,0,'2022-11-15 13:07:58','2022-11-15 13:07:58'),(37,'ps-01','assets/img/supplie/supplie_10032023_153828_547.jpeg','เต้นสนาม',500,30,19,'เต้นสนาม','',1,0,12,118,0,'2023-03-10 15:38:28','2023-03-10 15:38:28'),(38,'ball-01',NULL,'ลูกฟุตบอล',500,28,21,'ลูกฟุตบอล fbt','',1,0,12,118,0,'2023-03-13 12:10:33','2023-03-13 12:10:33'),(39,'mt-01',NULL,'สมุด',5,18,6,'ปกอ่อน','',1,0,20,131,0,'2023-03-14 16:12:51','2023-03-14 16:12:51'),(40,'0-25','assets/img/supplie/supplie_14032023_161339_199.png','ดินสอ',10,3,13,'2B','',1,0,20,131,0,'2023-03-14 16:13:39','2023-03-14 16:13:39'),(41,'pen-01',NULL,'ปากกา',200,18,18,'ปากกาลูกลื่น','ห้องพัสดุ',1,0,20,135,0,'2023-03-14 16:14:04','2023-03-14 16:15:14'),(42,'tenten-01',NULL,'เต็นท์สนาม',500,30,19,'เต็นท์สนามขนาดกลาง','',1,0,20,131,0,'2023-03-16 15:49:13','2023-03-16 15:49:13'),(43,'tk-01',NULL,'เทียนไข',100,30,6,'เทียนไขอย่างดี','',1,0,20,131,0,'2023-03-16 15:50:40','2023-03-16 15:50:40'),(44,'balloon-01',NULL,'ลูกโป่ง',20,30,21,'ลูกโป่งอย่างดี','',1,0,20,136,0,'2023-03-20 12:37:12','2023-03-20 12:37:43'),(45,'hp-001',NULL,'เครื่องถ่ายเอกสาร HP',2100,3,12,'เครื่องถ่ายเอกสาร HP ขนาดเล็ก','',1,0,20,131,0,'2023-03-20 14:21:52','2023-03-20 14:21:52');
/*!40000 ALTER TABLE `tb_supplies` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2023-04-03  7:16:20
